app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"
---
    def index
      a = params[:categories]
      p "````````````````````````````"
      p  a
      @products = Product.all
      if a.present? == true