app/controllers/admin/users_controller.rb

  def index
    @users = User.where(:role =>"normal")
---
SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "normal"]]

  def destroy
    @user = User.find_by_id(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 13]]