app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY name DESC
SELECT "products".* FROM "products" ORDER BY price DESC
SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 11]]
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "products" INNER JOIN "medials" ON "products"."id" = "medials"."product_id" WHERE "medials"."category_id" = ?  [["category_id", 1]]
---
  def index
    p "check ss"

    p "==========gg==============="
    p current_user
    p"~~~~~~~~~~~~~~~~~~~~~"
    case params[:sort_by]
    when "title-ascending"
      @products = Product.order('name ASC').paginate(:page => params[:page], :per_page => 5)
    when "title-descending"
      @products = Product.order('name DESC').paginate(:page => params[:page], :per_page => 5)
    when "price-ascending"
      @products = Product.order('price ASC').paginate(:page => params[:page], :per_page => 5)
    when "price-descending"
      @products = Product.order('price DESC').paginate(:page => params[:page], :per_page => 5)
    else
      @products = Product.all.paginate(:page => params[:page], :per_page => 5)
    end
    # p "========================"
    # p current_user

    @user= current_user

    @categories = Category.all
    @sl = []
    @categories.each do |q|
      a=Category.find_by_id(q.id).products.count

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit

    @product = Product.find_by_id(params[:id])

INSERT INTO "products" ("name", "price", "description", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "CONVERSE LOW"], ["created_at", "2018-08-01 04:01:14.319205"], ["updated_at", "2018-08-01 04:01:14.319205"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "CONVERSE LOW"], ["LIMIT", 1]]
---
  def create
    @product = Product.create(product_params)
    @product.save
    category_names = params[:category_name]
    category_names = category_names.split(",").map(&:strip).map(&:upcase)
    category_names.each do |c|
      category = Category.find_or_create_by(name: c)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    @product = Product.find_by_id(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @product = Product.find_by_id(params[:id])