app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    p "```````````````"
    p current_user
    p "----------------"
    if current_user.role != "admin"
        redirect_to root_path
    end
    else
    @users =User.all

UPDATE "users" SET "name" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "miker"], ["encrypted_password", "$2a$11$LQl6kbmbXThSoAGQvKwEg.4RRhcZB00nCe9sTKVrWPljZcZW4oB2q"], ["updated_at", "2018-07-31 10:25:00.001196"], ["id", 2]]
---
  def update
    @user = current_user
     if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user = current_user
    @user.destroy