app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def edit
      @user = User.find_by_id(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", "admin"], ["updated_at", "2018-08-06 07:51:31.418233"], ["id", 3]]
---
  def update
    @user = User.find_by_id(params[:id])
     if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 12]]
---
  def destroy
    @user = User.find_by_id(params[:id])
    @user.destroy